app/controllers/messages_controller.rb

INSERT INTO "messages" ("text", "encryption_type", "link", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "Helloooo"], ["encryption_type", "Destroy after 1 hour"], ["link", "EBEXD08qTOWMiw"], ["password", "123"], ["created_at", 2016-10-16 16:37:24 UTC], ["updated_at", 2016-10-16 16:37:24 UTC]]
UPDATE "messages" SET "text" = $1, "secret_code" = $2, "updated_at" = $3 WHERE "messages"."id" = $4  [["text", "8dMK+Oq/jPObvJKASOE1Q2VMHrmf4VSMyoM73KMkDmM=\n"], ["secret_code", "ruby"], ["updated_at", 2016-10-16 17:31:27 UTC], ["id", 5]]
---
  def create
    @message = Message.create(message_params)
    @message.text = AESCrypt.encrypt(params[:message][:text], params[:message][:secret_code])
    @message.secret_code = params[:message][:secret_code]
    @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."link" = $1 LIMIT $2  [["link", "eN3wRQDlqKG_KQ"], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 3]]
UPDATE "messages" SET "created_at" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["created_at", 2016-10-16 16:03:51 UTC], ["updated_at", 2016-10-16 16:09:59 UTC], ["id", 5]]
---
  def show
    @message = Message.find_by(link: params[:id])

    if params[:secret_code_input].nil?
      redirect_to message_verify_message_path(@message.link)
    else
      if @message.secret_code == params[:secret_code_input][:secret_code]
        @decrypted_message = AESCrypt.decrypt(@message.text, params[:secret_code_input][:secret_code])
      else
        redirect_to message_verify_message_path(@message.link)
        flash[:warning] = "Неверный пароль"
      end

      if @message.encryption_type == "Destroy message after the first link visit"
        if @message.is_visited == true
          @message.destroy
          redirect_to root_path
          flash[:warning] = "Сообщение было удалено"
        else
          @message.is_visited = true
          @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."link" = $1 LIMIT $2  [["link", "30"], ["LIMIT", 1]]
---
  def link
    @message = Message.find_by(link: params[:id])